Revit 2027 API
ParameterTypeId.ViewSolarstudyLightingAltitudeText Property
 "Lighting altitude text"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudyLightingAltitudeText { get; }
Public Shared ReadOnly Property ViewSolarstudyLightingAltitudeText As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudyLightingAltitudeText {
	ForgeTypeId^ get ();
}
static member ViewSolarstudyLightingAltitudeText : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace